app/controllers/projects_controller.rb

  def show
    #if params[:owner] && params[:name]
    #  @project = Project.find_by_owner_id_and_name(User.find_by_login(params[:owner]), params[:name])
    #else
      @project = Project.find(params[:id])
    #end
    #if @project.nil?
    #  respond_to do |format|
    #    flash[:error] = "This project does not exist."
    #    format.html { redirect_to projects_path }
    #    format.xml { redirect_to projects_path }
    #  end
    #else
      @last_running = @project.project_times.last_running(current_user)
      @last_running = @last_running.blank? ? nil : @last_running[0]
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT "projects".id FROM "projects" INNER JOIN "user_projects" ON "projects".id = "user_projects".project_id WHERE (("user_projects".user_id = 2))
SELECT * FROM "project_times" WHERE ("project_times".project_id = 4) AND ((project_id = 4 AND user_id = 2 AND end_time = NULL) AND ("project_times".project_id = 4)) ORDER BY end_time ASC LIMIT 1

  def create
    params[:project][:owner_id] = current_user.id
    @project = Project.new(params[:project])
    @project.users << current_user
---
INSERT INTO "projects" ("name", "updated_at", "owner_id", "created_at") VALUES('test project', '2009-08-28 04:21:48', 2, '2009-08-28 04:21:48')

  def destroy
    @project = Project.find(params[:id])
    @project.destroy
---
SELECT * FROM "projects" WHERE ("projects"."id" = 3)
DELETE FROM "projects" WHERE "id" = 3

  def start
    @project = Project.find(params[:id])
    @project_time = ProjectTime.new(:user_id => current_user.id, :project_id => @project.id, :start_time => DateTime.now)
    @project_time.save
---
SELECT * FROM "projects" WHERE ("projects"."id" = 4)
INSERT INTO "project_times" ("end_time", "created_at", "project_id", "updated_at", "notes", "user_id", "start_time") VALUES(NULL, '2009-09-03 05:20:11', 4, '2009-09-03 05:20:11', NULL, 2, '2009-09-03 05:20:11')

  def stop
    @project_time = ProjectTime.find(params[:id])
    @project_time.end_time = DateTime.now
    @project_time.notes = params[:notes]
    @project_time.save
---
SELECT * FROM "project_times" WHERE ("project_times"."id" = 2)
UPDATE "project_times" SET "updated_at" = '2009-09-03 05:20:18', "notes" = 'this is a test', "end_time" = '2009-09-03 05:20:18' WHERE "id" = 21

  def add_time
    @project = Project.find(params[:id])
    params[:project_time].merge! :user_id => current_user.id, :project_id => @project.id
    @project_time = ProjectTime.new(params[:project_time])
    @project_time.save
---
SELECT * FROM "projects" WHERE ("projects"."id" = 4)
INSERT INTO "project_times" ("end_time", "created_at", "project_id", "updated_at", "notes", "user_id", "start_time") VALUES('2009-09-09 21:53:00', '2009-09-09 22:03:49', 4, '2009-09-09 22:03:49', 'test', 2, '2009-09-09 19:53:00')