app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('', '25f2a23a3ff88ebc12e82a113d12d26306072f7a', '2009-08-28 04:13:30', '20ebc59b41a4d3e061a861701b248bad4f3201da', NULL, NULL, 'yelvert', 'tny5357@gmail.com', '2009-08-28 04:13:30')
---
  def create
    puts RAILS_ENV
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save